'''5.1 数据运算处理  数组运算 单值 一维(series) 二维(DF)  pandas一般是单值、一维和二维之间的运算
尽量做矩阵运算，即数组  避免单值与单值之间'''
#5.1.1 运算符与运算函数 + - * / % **幂 比较 == ！= >= <= +连接 & | `非  
import pandas as pd
df=pd.read_excel('J:/py/Excel-pandas数据分析/切片法1.xls')   #方法  + 和 .add
df['1月']=df['1月']+12    #符号相加   一维与单值
df['1月']=df['1月'].add(12)     #函数相加

df[['2月','3月']]=df[['2月','3月']]+12       #二维与单值  

df['3月']=df['1月']+df['2月']    #一维和一维

df=df+df  #DF与DF

df=df+pd.Series(['A','生',100,200,300],index=['姓名','性别','1月','2月','3月'])   #DF与一维 列相加
df[['2月','3月']]=df[['2月','3月']].add(pd.Series([10,100,1000],index=[0,1,2]),axis=0)  #行相加  默认列运算不能用+

df=df['数学']+df['数学']   #Series按索引对齐
df=df['数学'].add(df['数学'],fill_value=0) #如果有缺失值填充0

